{
    "The :attribute must be a valid role.": "Поле должно содержать действительную роль.",
    "The :attribute must be at least :length characters and contain at least one number.": "Поле должно содержать не менее :length символов и хотя бы одну цифру.",
    "The :attribute must be at least :length characters and contain at least one special character and one number.": "Поле должно содержать не менее :length символов, хотя бы один специальный символ и одну цифру.",
    "The :attribute must be at least :length characters and contain at least one special character.": "Поле должно содержать не менее :length символов и хотя бы один специальный символ.",
    "The :attribute must be at least :length characters and contain at least one uppercase character and one number.": "Поле должно содержать не менее :length символов, хотя бы одну прописную букву и одну цифру.",
    "The :attribute must be at least :length characters and contain at least one uppercase character and one special character.": "Поле должно содержать не менее :length символов, хотя бы одну прописную букву и один специальный символ.",
    "The :attribute must be at least :length characters and contain at least one uppercase character, one number, and one special character.": "Поле должно содержать не менее :length символов, хотя бы одну прописную букву, одну цифру и один специальный символ.",
    "The :attribute must be at least :length characters and contain at least one uppercase character.": "Поле должно содержать не менее :length символов и хотя бы одну прописную букву.",
    "The :attribute must be at least :length characters.": "Поле должно содержать не менее :length символов.",
    "The :attribute must contain at least one letter.": "Поле должно содержать хотя бы одну букву.",
    "The :attribute must contain at least one number.": "Поле должно содержать хотя бы одну цифру.",
    "The :attribute must contain at least one symbol.": "Поле должно содержать хотя бы один символ.",
    "The :attribute must contain at least one uppercase and one lowercase letter.": "Поле должно содержать хотя бы одну прописную и одну строчную букву.",
    "The given :attribute has appeared in a data leak. Please choose a different :attribute.": "Указанное значение обнаружено в утечке данных. Пожалуйста, выберите другое значение."
}